Tekla Open API Reference for Tekla Structures 2025
BaseWeld.AdditionalSizeAbove Property
 Gets or sets the additional size above for combination welds.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double AdditionalSizeAbove { get; set; }
Public Property AdditionalSizeAbove As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
BaseWeld Class
Tekla.Structures.Model Namespace